// pages/materialCenter/deviceDetail/index.js
const materialList = require("../materialList/materialList.js").materialList;
Page({

  /**
   * 页面的初始数据
   */
  data: {
    //banner参数开始
    imgUrls: ['http://baogongxia1.oss-cn-shenzhen.aliyuncs.com/banner/index1.jpg',
      'http://baogongxia1.oss-cn-shenzhen.aliyuncs.com/banner/index2.jpg',
      'http://baogongxia1.oss-cn-shenzhen.aliyuncs.com/banner/index3.jpg',
    ],
    indicatorDots: true,
    autoplay: false,
    interval: 5000,
    duration: 1000,
    //banner参数结束
    // 是否收藏
    isShoucang: false,
    // 评论列表
    evaluateList: [{
        img: "/pages/icons/fawu03.png",
        phone: "19966668888",
        score: "4.5",
        rater: "好评",
        time: "2019-01-01",
        content: "在平台上买了好几台设备了，货真价实，比外面便宜很多，以后还会继续来这儿买，超级推荐",
      },
      {
        img: "/pages/icons/fawu02.png",
        phone: "18155556666",
        score: "4.5",
        rater: "好评",
        time: "2019-01-01",
        content: "平台真实可靠，性价比高，发货及时，好评",
      },
      {
        img: "/pages/icons/fawu01.png",
        phone: "19966668888",
        score: "4.5",
        rater: "好评",
        time: "2019-01-01",
        content: "在平台上买了好几台设备了，货真价实，比外面便宜很多，以后还会继续来这儿买，超级推荐",
      },
    ],
    // 详情
    dataDetail: [],
    spid: "",
    // 详情文字 1 
    detail_text1: {
      title: "灭火特点和原理",
      children1: {
        title: "1. 灭火特点",
        content: ["七氟丙烷灭火剂的化学分子式为CF3CHFCF3，熔点-13.10°C，沸点16.40°C，是一种无色、无味、具有良好的情节性(在大气中完全消化不留痕)和良好的气相电绝缘性。无毒，不损耗大气臭氧层，是哈龙的取代品，目前在世界和全国范围内得到推广和广泛使用。"]
      },
      children2: {
        title: "2. 灭火原理",
        content: ["在高温条件下，七氟丙烷发生物理反应和化学反应，分级出含氟的自由基，与燃烧过程中产生的支链反应的氢离子、氢氧离子等火星自由基发生气相作用，中断燃烧链，从而抑制燃烧反应，另外，七氟丙烷化学反应中的化学链断裂和释放气体过程中吸收大量的热，从而可冷却灭火。"]
      },
      children3: {
        title: "性能参数",
        content: [
          "灭火形式：全淹没式",
          "存储容器容积(L)：40L 70L 100L 120L 150L 180L",
          "灭火浓度：根据防护区可燃物的性质选择确定",
          "七氟丙烷充装密度≤950kg/m³",
          "灭火喷射时间≤10S",
          "贮存压力(20°C)：4.2MPa/5.6MPa",
          "最大工作压力(50°C)：5.3MPa/6.8MPa",
          "执行标准：GB25972-2010",
          "阀驱动装置氮气电源压力(20°C)：6.0MPa",
          "灭火系统工作电源：AC220V/50HZ",
          "备用电源：DC24V",
          "功率消耗：警戒≥15W，报警时≥30W",
          "环境条件：温度0°C~50°C，相对湿度≤97%",
          "启动方式：自动、电气手动、机械应急操作",
          "自动启动延时时间：0~30S"
        ]
      }
    },
    // 详情文字 2 
    detail_text2: {
      title: "灭火特点和原理",
      children1: {
        title: "1. 工作原理",
        content: ["IG541主要是将燃烧物周围的空气含量降低到扩散火焰所需的15%的氧气含量以下而灭火，即主要是窒息作用灭火"]
      },
      children2: {
        title: "2. 启动方式",
        content: ["本系统有三种启动方式：自动启动方式、手动启动方式和机械应急操作启动方式"]
      },
      children3: {
        title: "3. 自动启动方式",
        content: ["气体灭火报警控制系统一般配有两种不同类型的火灾探测器。控制主机上有“自动”和“手动”转换开关(转换开关也可与主机分开，设置在防护区外)，当将其置于“自动”位置时，灭火系统处于自动状态。当只有一种探测器发生火灾信号时，控制主机自动警铃或者声光报警器通知火灾发生，但并不启动灭火系统。当两种探测器发生火灾信号时，控制主机启动警铃和声光报警器，联动关闭防护开口，进入灭火启动延时，达到设定的延时时间后，自动启动灭火系统。如在喷发延时过程中发现不需要启动灭火系统，可按下防护区外或控制器上的“紧急停止”按钮，终止灭火指令。"]
      },
      children4: {
        title: "4. 手动启动方式",
        content: ["当转换开关置于“手动”位置时，灭火装置处于手动状态。在该状态下，探测器发生火灾信号，控制主启动警铃和声光报警器，通知火灾发生，但并不启动灭火系统。此时按下防护区外或者控制器上的“手动启动”或者“紧急启动”按钮，可以启动灭火系统。注意：无论在控制器处于自动或者手动状态，按下“紧急启动”和“手机启动”按钮，都可以启动灭火系统。"]
      },
      children5: {
        title: "5. 机械应急启动方式",
        content: ["当自动和手动启动失效时，可按以下步骤实施机械应急操作：1) 手动关闭联动设备并切断电源；2)拔出相关防护区启动瓶电磁驱动器上的“机械应急启动报销”，按下机械应急启动按钮，电磁驱动器打开启动瓶释放启动气体，启动灭火系统。"]
      },
      children6: {
        title: "性能参数",
        content: [
          [
            "型号",
            "IG-541/70L",
            "IG-541/80L",
            "IG-541/90L",
          ],
          [
            "设计压力",
            "17.2",
            "17.2",
            "17.2"
          ],
          [
            "工作压力",
            "15",
            "15",
            "15"
          ],
          [
            "适用环境温度(°C)",
            "0~50",
            "0~50",
            "0~50",
          ],
          [
            "安全释放压力(MPa)",
            "23±1.15",
            "23±1.15",
            "23±1.15",
          ],
          [
            "药剂储存瓶高度H(mm)",
            "1320",
            "1320",
            "1460",
          ],
          [
            "药剂储存瓶净重(kg)",
            "96",
            "105",
            "137"
          ],
          [
            "混合气体充装量",
            "14.7",
            "16.8",
            "18.9",
          ]
        ]
      }
    },
    // 详情文字 3 
    detail_text3: {
      children1: {
        title: "灭火特点应用",
        content: [
          "本装置主要适用于以下火灾：",
          "1) 固体表面火灾;",
          "2) 液体火灾;",
          "3) 灭火前能切断气源的气体火灾;",
          "4) 电气火灾;",
          "典型引用场所：",
          "主要适用于电子计算机房、数据处理中心、电信通讯设施、过程控制中心、昂贵的医疗设施、贵重工业设备、博物馆、艺术馆、图书馆、档案馆、贵重物品库、应急电力设施、易燃液体存储区、洁净厂房等重点场所的消防保护，也可以用于生产作业火灾危险场所，如喷漆生产线、电气老化间、轧制机、印刷机、融化槽、烘干设备、水泥生产流程中的煤粉仓，以及船舶机场、货舱等。本装置可单独设置用来保护较小空间的保护区。也可多台联用保护较大空间的保护区。"
        ]
      },
      children2: {
        title: "性能参数",
        content: [
          "灭火形式：全淹没式",
          "储存容器容积(L)：90L 100L 120L 150L",
          "灭火浓度：根据防护区可燃物的性质选择确定",
          "七氟丙烷充装密度≤1120kg/m³",
          "灭火喷射时间≤10S",
          "贮存压力(20°C)：1.6MPa",
          "最大工作压力(50°C)：2.5MPa",
          "执行标准：GB16670-2006",
          "阀驱动器：电磁型驱动器",
          "启动电源：DC24V 1.2A",
          "七氟丙烷气体的环境特性",
          "NOAEL(%,V,/V)：9.0",
          "LOAEL(%,V,/V)：10.5",
          "LC50(%,V,/V)：> 80",
          "七氟丙烷气体的灭火特性",
          "杯装燃烧器灭火体积分数(正庚烷)：0.066",
          "B类火最小设计体积分数：0.079",
          "惰性甲烷/空气设计体积分数：8.8",
          "相对于哈龙1301所需的质量：1.9",
          "相对于哈龙1301所需的存储：1.8",
          "体积：1.8",
          "规定喷发时间/S：8~10",
          "气瓶压力/Pa(x10)：24~42",
          "最大填充浓度/kg/m³：1150",
          "化学和物理灭火器机理：以化学灭火为主",
          "气相电绝缘性：良好",
          "储存性和稳定性：良好",
          "防护区要求(有管网)：≤800m³，3600m³",
          "防护区要求(无管网)：≤500m³，1600m³",
          "七氟丙烷气体雾化性质",
          "相对分子质量：170",
          "分子式：CF3CHFCF3",
          "沸点/°C：-16.4",
          "冰点/°C：-131",
          "密度/kg.d/m³：1.4",
          "蒸气压(25°C)/MPa：0.45",
          "沸点下饱和蒸汽密度/kg.d/m³：0.03",
          "临界温度/°C：101.7",
          "临界压力/MPa：2.912",
          "临界密度/kg.d/m³：0.621",
          "沸点下政法潜热/kj/kg：132.6",
          "水在药剂下溶解度/%(m/m)：0.06",
          "热导系数(25°C,液体)w/m.°C：0.069"
        ],
      }
    }
  },
  // 收藏
  onShoucang: function() {
    this.setData({
      isShoucang: !this.data.isShoucang
    })
  },
  // 更多评论
  onMOreEvaluate: function(e) {
    wx.navigateTo({
      url: '../evaluateList/index',
      success: function(res) {},
      fail: function(res) {},
      complete: function(res) {},
    })
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function(options) {
    let _this = this;
    let spid = options.spid;
    materialList.forEach((item) => {
      if (spid == item.sp_id) {
        console.log(JSON.stringify(item));
        _this.setData({
          dataDetail: item,
          spid,
        })
      }
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function() {

  }
})